vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32g070/TIM_reginfo.h
/* This file is generated by stm32_reggen.py from stm32g070xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the TIM register metadata for the stm32g070 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
static const stm32_reginfo_t stm32_g070_tim_reginfo[RI_END] =
{
	[RI_CR1            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000BFF }, /* mask = 0b00000000000000000000101111111111 */
	[RI_CR2            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00F57FFD }, /* mask = 0b00000000111101010111111111111101 */
	[RI_SMCR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0031FFFF }, /* mask = 0b00000000001100011111111111111111 */
	[RI_DIER           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00007FFF }, /* mask = 0b00000000000000000111111111111111 */
	[RI_SR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00033FFF }, /* mask = 0b00000000000000110011111111111111 */
	[RI_EGR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000001FF }, /* mask = 0b00000000000000000000000111111111 */
	[RI_CCMR1          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0101FFFF }, /* mask = 0b00000001000000011111111111111111 */
	[RI_CCMR2          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0101FFFF }, /* mask = 0b00000001000000011111111111111111 */
	[RI_CCER           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0033BFFF }, /* mask = 0b00000000001100111011111111111111 */
	[RI_CNT            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_PSC            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_ARR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_RCR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_CCR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_CCR2           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_CCR3           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_CCR4           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_BDTR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x3FFFFFFF }, /* mask = 0b00111111111111111111111111111111 */
	[RI_DCR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00001F1F, .mask = 0x00001F1F }, /* mask = 0b00000000000000000001111100011111 */
	[RI_DMAR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000FFFF, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_OR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_CCMR3          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0101FCFC, .mask = 0x0101FCFC }, /* mask = 0b00000001000000011111110011111100 */
	[RI_CCR5           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFFFFFFFF, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_CCR6           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000FFFF, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_AF1            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_AF2            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_TISEL          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0F0F0F0F, .mask = 0x0F0F0F0F }, /* mask = 0b00001111000011110000111100001111 */
};

